# RebarShapeMultiplanarDefinition Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeMultiplanarDefinition Properties
RebarShapeMultiplanarDefinition Class See Also
---
The RebarShapeMultiplanarDefinition type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DepthParamId | Id of the parameter driving the multiplanar depth. The depth is measured center-to-center of the bar. A valid shape parameter must be assigned to DepthParamId before the MultiplanarDefinition can be used in RebarShape creation. |
| IsDuplicateShapePresent | Whether the shape definition includes an offset copy of the 2D shape. |
| IsEndConnectorPresent | Whether a perpendicular segment is constructed from the end of the 2D shape. |
| IsStartConnectorPresent | Whether a perpendicular segment is constructed from the start of the 2D shape. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OutOfPlaneBendDiameter | Bend diameter to be applied to the connector segments. |

# See Also
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace